Autodesk.Revit.DB.Surface.OrientationMatchesParametricOrientation
Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation.
Remarks:
A surface's orientation may be specified by choosing one of the two oppositely oriented unit normal vector fields along the surface
(Revit uses only orientable surfaces). A surface's parametric orientation can be defined by the vector field defined as the unitized
cross product of the surface's first partial derivatives: dS/du x dS/dv. A surface's orientation is then defined by
getOrientationMatchesParametricOrientation(); if getOrientationMatchesParametricOrientation() is true, the surface's orientation
is the same as its parametric orientation, otherwise it is opposite to its parametric orientation.
See also Face::OrientationMatchesSurfaceOrientation.
Since:
2018